import { Matches } from './common';

/**
 * 账号属性验证
 */
export const ValidatorAccount = {
  USERNAME: Matches(/^[\d\w-_]{4,32}$/, '请输入正确的用户名，4-32位、字母、数字、下划线、减号'),
  PASSWORD: Matches(/^[\d\w-_]{4,32}$/, '请输入正确的密码，4-32位、字母、数字、下划线、减号'),
  NICKNAME: Matches(/^[\d\w\u4e00-\u9fa5-_]{2,15}$/, '请输入正确的昵称，2-32位、中文、字母、数字，下划线、减号'),
  PHONE: Matches(
    /^(?:(?:\+|00)86)?1(?:(?:3[\d])|(?:4[5-79])|(?:5[0-35-9])|(?:6[5-7])|(?:7[0-8])|(?:8[\d])|(?:9[189]))\d{8}$/,
    '请输入正确格式的手机号'
  ),
  IP: Matches(
    /^((\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])\.){3}(\d|[1-9]\d|1\d\d|2[0-4]\d|25[0-5])(?::(?:[0-9]|[1-9][0-9]{1,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]))?$/,
    '请输入正确的IP地址'
  ),
};
